{
  "about": {
    "me": "About me",
    "p1": "Hello everyone! I'm a frontend developer. I've had extensive training at the best frontend development school - The Rolling Scopes School, where I honed my skills and gained practical experience in various projects.",
    "p2": "During my training I have successfully completed a wide range of projects, from simple landings to complex one-page applications. One notable achievement was leading a team of three in the development of an English language learning application.",
    "p3": "I am currently keen to continually develop my skills and keep up to date with the latest industry trends. I am looking to join a dynamic company where I can use my experience and contribute to the development of in-demand products."
  },
  "general": {
    "job": "Frontend Developer",
    "name": "Uladzimir Karnialiuk",
    "project": "Featured Project",
    "description": "Description",
    "technology": "Technologies",
    "filter": "Filter",
    "lang": "Languages:",
    "framework": "Frameworks:",
    "reset": "Reset",
    "stack": "Stack",
    "visit": "Visit the portfolio section to learn more",
    "more": "View more",
    "home": "Home",
    "portfolio": "Portfolio",
    "contacts": "Contacts",
    "links": {
      "github": "You can find this project on",
      "deploy": "You can view this project",
      "here": "Here"
    },
    "contacts-info": {
      "mail": "I can be reached at the following email:",
      "another": "Feel free to connect with me on any of the following platforms:"
    }
  },
  "projects": {
    "rs-network": {
      "info": "Application represents the platform to allow users to communicate via public text messages. Before starting to use the service a guest must register and sign in. Authorized user can see vertically divided main page, where left side is a list of public group and right side is a list of people including personal conversations. Each user can create own public group and broadcast messages there or use existing group along with other participants. Personal information can be viewed on a special profile page, where it can be immediately edited.",
      "tech": "Angular Application: Connections project with real backend.",
      "warn": "Please use a fake email!"
    },
    "youtube": {
      "info": "YouTube video search application. User can sort search results by date, views, can also filter results by video title, add cards to favourites, create your own cards, view full information about the video. To use the application, the user must be logged in.",
      "tech": "Angular Application: YouTube video search app using Google API."
    },
    "keyboard": {
      "tech": "The generation of DOM elements is implemented. body in the index.html is empty",
      "info": "The virtual keyboard is able to switch between two language layouts (En + Ru language).Processing of keystrokes on the keyboard, interaction between the keyboard and mouse. All HTML generation takes place in the application script, the HTML file is empty. The buttons on the virtual keyboard display symbols of a selected language.The application saves a chosen language after the page is reloaded and displays the keyboard on that language. Clicks on the buttons with a mouse on the virtual keyboard and pressing keys on a physical keyboard should input symbols to the text area located on the page above the virtual keyboard.The keyboard shortcut for changing language indicated on the page  it clear for a user how to switch keyboard layout."
    },
    "online-store": {
      "tech": "Online store of laptops created on Typescrypt without HTML",
      "info": "Online store created on Typescript User can sort product cards by Search bar, multiple sorting options: Name, Year, Color, Stock, Quantity, Popular. You can also add items to cart and remove them from it.Reset search parameters, reset local store settings, all data will be saved in local store.Minimum resolution of the application is 768 pixels.All HTML generation is done in application script, HTML file is empty."
    },
    "shelter": {
      "tech": "JavaScript project: Website of a pet shelter (Landing page)",
      "info": "Animal shelter website is a landing page made using technologies such as JavaScript, HTML, CSS, Webpack.This project implements: burger menu, custom sliders, popup with additional information about the card, pagination, mobile version, tracking positions and screen size."
    },
    "race": {
      "tech": "SPA (single page application). It is written in Typescript without using any frameworks.",
      "info": "SPA on Typescript. User can switch between two pages - Garage and Winners table. In the race it is possible to race all cars simultaneously or each one in turn. User can create a custom car or create 100 random cars at once in one click."
    }
  },
  "resume": "https://drive.google.com/file/d/1DxELV86N_UcdJIgYL9jKojyLEvRD5Lb4/view?usp=sharing"
}
