{
  "about": {
    "me": "Обо мне",
    "p1": "Привет всем! Я фронтенд-разработчик. Я прошел длительное обучение в лучшей школе фронтенд-разработчиков - The Rolling Scopes School, где оттачивал свои навыки и получал практический опыт в различных проектах.",
    "p2": "За время обучения я успешно выполнил широкий спектр проектов, от простых лендингов до сложных одностраничных приложений. Одним из заметных достижений было руководство командой из трех человек при разработке приложения для изучения английского языка.",
    "p3": "В настоящее время я стремлюсь постоянно совершенствовать свои навыки и быть в курсе последних тенденций в отрасли. Я активно ищу работу в динамичной компании, где смогу использовать свой опыт и внести вклад в разработку востребованных приложений."
  },
  "general": {
    "job": "Frontend разработчик",
    "name": "Владимир Корнелюк",
    "project": "Проект",
    "description": "Описание",
    "technology": "Технологии",
    "filter": "Фильтр",
    "lang": "Языки:",
    "framework": "Фрэймворки:",
    "reset": "Сброс",
    "stack": "Стэк:",
    "visit": "Посетите раздел портфолио, чтобы узнать больше",
    "more": "Подробнее",
    "home": "Главная",
    "portfolio": "Портфолио",
    "contacts": "Контакты",
    "links": {
      "github": "Вы можете найти этот проект на",
      "deploy": "Вы можете посмотреть этот проект",
      "here": "Здесь"
    },
    "contacts-info": {
      "mail": "Со мной можно связаться по почте:",
      "another": "Можно обратиться ко мне на любой из следующих платформ:"
    }
  },
  "projects": {
    "rs-network": {
      "info": "Приложение представляет собой платформу, позволяющую пользователям общаться посредством публичных текстовых сообщений. Прежде чем начать пользоваться сервисом, гость должен зарегистрироваться и войти в систему. Авторизованный пользователь видит вертикально разделенную главную страницу, где слева находится список публичных групп, а справа - список людей, включая личные беседы. Каждый пользователь может создать собственную публичную группу и транслировать в нее сообщения или использовать существующую группу вместе с другими участниками. Личная информация отображается на специальной странице профиля, где ее можно сразу же отредактировать.",
      "tech": "Ангуляр приложение: Проект c использованием реального бэкенда.",
      "warn": "Пожалуйста, используйте фэйковый e-mail!"
    },
    "youtube": {
      "info": "Приложение для поиска видео на YouTube. Пользователь может сортировать результаты поиска по дате, просмотрам, фильтровать результаты по названию видео, добавлять карточки в избранное, создавать свои собственные карточки, просматривать полную информацию о видео. Чтобы воспользоваться приложением, пользователь должен быть авторизован.",
      "tech": "Ангуляр приложение: Приложение для поиска видео на YouTube с использованием Google API."
    },
    "keyboard": {
      "tech": "Реализована генерация элементов DOM, тело в index.html пустое.",
      "info": "Виртуальная клавиатура способна переключаться между двумя языковыми раскладками (En + Ru).Обработка нажатий на клавиатуре, взаимодействие клавиатуры и мыши. Вся генерация HTML происходит в скрипте приложения, HTML-файл пуст. Кнопки виртуальной клавиатуры отображают символы выбранного языка.Приложение сохраняет выбранный язык после перезагрузки страницы и отображает клавиатуру на этом языке. Щелчки мышью по кнопкам на виртуальной клавиатуре и нажатие клавиш на физической клавиатуре должны вводить символы в текстовую область, расположенную на странице над виртуальной клавиатурой.Сочетание клавиш для смены языка указано на странице, чтобы пользователю было понятно, как переключать раскладку клавиатуры."
    },
    "online-store": {
      "tech": "Интернет-магазин ноутбуков, созданный на Typescrypt без HTML",
      "info": "Интернет-магазин, созданный на Typescript Пользователь может сортировать карточки товаров с помощью строки поиска, несколько вариантов сортировки: Название, Год, Цвет, В наличии на складе, Количество, Популярные. Также можно добавлять товары в корзину и удалять их из нее.Сброс параметров поиска, сброс настроек локального магазина, все данные будут сохранены в локальном сторе.Минимальное разрешение приложения 768 пикселей.Вся генерация HTML осуществляется в скрипте приложения, HTML файл пустой."
    },
    "shelter": {
      "tech": "Проект на JavaScript: Сайт приюта для животных (Лэндинг)",
      "info": "Сайт приюта для животных представляет собой лэндинг, выполненный с использованием таких технологий, как JavaScript, HTML, CSS, Webpack. В данном проекте реализованы: бургер-меню, кастомные слайдеры, всплывающее окно с дополнительной информацией о карточке, кастомная пагинация, мобильная версия, отслеживание позиций и размера экрана."
    },
    "race": {
      "tech": "SPA (одностраничное приложение). Написано на Typescript без использования фреймворков.",
      "info": "SPA на Typescript. Пользователь может переключаться между двумя страницами - гаражом и таблицей победителей. В гонке можно задействовать все автомобили одновременно или каждый по очереди. Пользователь может создать пользовательский автомобиль или создать 100 случайных автомобилей сразу в один клик."
    }
  },
  "resume": "https://drive.google.com/file/d/1oBaZ1bxTdQQRHBF9gwHvdV273P8-pNp-/view?usp=sharing"
}
